let foodList = "엽떡 초코크림빵 묵은지김밥 간장게장 족발 수육 명란구이 잔치국수탕수육 물냉면 비빔냉면 쭈꾸미삼겹 치즈등갈비 육회비빔밥벌집삼겹살 버블티 차돌된장찌개 짜장면 월남쌈 짬뽕 잡탕밥 돼지갈비LA갈비 유부초밥 소갈비 참치김치찌개 호박떡 육개장 팔보채 평양냉면알밥 대패삼겹살 파김치에짜파게티 꽈배기도넛 꽃삼겹살 초밥회오리감자 호미빙 오징어버터구이 연탄불고기 오레오빙수 연두부회덮밥 깐풍기 미역국 물회 콩나물국밥 오징어회 참치회 고등어구이명란젓 실비김치 고사리 크림카레우동 갈비찜 치맥 돈까스 볶음김치계란말이 숯불닭갈비 소고기무국 곰탕 갈비탕 호박전 치즈감자고로케쫄병스낵 케밥 골뱅이무침 깍두기 비빔국수 꽃빵 참치비빔밥불고기버거 겉절이 수제비 파전 명이나물 피자찐빵 오돌뼈 양념게장팟타이 떡볶이 뼈해장국 가리비구이 비지찌개 무지개떡 간장새우 김밥녹차모찌 생새우초밥 남산왕돈까스 모닥치기 조랭이떡 녹치케골뱅이소면무침 김치만두 군만두 물만두 찐빵 멸치볶음 쫄면 순대 곱창대창막창 콩나물무침 모찌롤 냉치킨 선지해장국 깐쇼새우 유산슬고구마빵 돼지국밥 횡성한우 파김치 새우죽 고추장찌개 통감자 엽떡회냉면 낙지젓 육포 고구마밥 생선까스 오이지 된장국 찹쌀도넛 백김치파래 안동찜닭 까르보나라떡볶이 설렁탕 석박지 어묵꼬치 열무비빔밥광어회 고추잡채 닭도리탕 참치볶음 슈크림빵 오징어무침 양념갈비닭똥집 식혜 한우스테이크 돌솥비빔밥 성게알 야쿠르트 조기구이돼지갈비찜 명란스파게티 후쿠오카함바그 파무침 미숫가루 총각김치쌈장 떡갈비 양꼬치 홍초 굴짬뽕밥 말린과일 볶음우동 닭강정 된장국동치미 떡꼬치 김말이튀김 두부 냉이된장국 치즈돈까스정식 쟁반짜장연어알 삼계탕 카레우동 찹쌀도넛 관자 호로요이 순두부찌개이삭토스트 국물닭발 해물순두부 오설록 군밤 붕어빵 규동 편육 쌀국수볶음밥 김치전 소갈비찜 동그랑땡 유자차 송편 우삼겹 쟁반짜장 전병뼈해장국 스테키동 텐텐 바나나맛우유 새우젓 감자떡 맥심골드주먹김밥 갈치조림 안성국밥 호박나물 짜장밥 고구마 마파두부 감자탕육사시미 곱창전골 불고기 숙주나물 호떡 참치김밥 타코야끼 참치뱃살떡국 김치전 춘장에양파 약과 호박찌개 알탕 잡채 카레라이스 마크정식명란삼각김밥 녹차라떼 꽃등심 함박스테이크 소금구이 잡채밥 묵은지토마토리조또 초고추장 복숭아 맥반석오징어 라면 파닭 찹쌀떡로이스초콜릿 어포 홍합 양구이 백설기 단호박죽 오감자칠리 장조림청국장우동 김칫국 횡성한우 야채곱창 몽쉘 오예스 꼬막 돼지껍데기빈대떡 샤브샤브 오리훈제구이 아침햇살 아구찜 전복 항정살 닭발산낙지 생간 뻥튀기 찰보리밥 고구마스틱 삼각커피우유 메리딸기메리초코 카스타드 육회 라볶이 제육볶음 취나물 꼬꼬면 오이냉국삼각커피우유 짜글이 소고기야채죽 닭갈비 쭈꾸미 꼬마김밥 짬뽕밥찹쌀탕수육 카레 양대창 짜장밥 파리바게트순수우유케이크 가츠동밥버거 갓김치 틈새라면 닭발 계란찜 매운탕홍어무침 꿔바로우허니버터칩 곶감 표고버섯 오이김치 셀렉션초코맛 두유 주먹밥 날치알고르곤졸라 꽃게랑 고기만두 감자수제비 왕만두 참치마요 고기육수규카츠 라멘 낙지호롱구이 떡만두국 초코퍼지아이스크림 소갈비찜기름떡볶이 염통 메로나 엽떡 가리비구이 불초밥 당면 스파클링와인부대찌개 부추김치 천엽 간짜장 꽃게탕 홍합탕 두유 팥빙수 고구마피자아구탕 내장볶음 두부김치 비름나물 조개구이 목살스테이크 버섯전골간장치킨 스프링롤 북어탕 치즈곱창 팽이버섯 쭈꾸미 인절미 쌈무민물장어 간 뚝배기불고기 인절미빙수 돈까스김밥 시래기국 찐옥수수민트초코우유 검은콩우유 뽀글이 황태해장국 동태전 설빙 탕평채무지개케익 소고기덮밥 등갈비 포카리스웨트 보쌈 짜장라면 쌀통닭해파리냉채 돼지김치찌개 김치부침개 콩국수 동지팥죽 철판볶음밥춘천닭갈비 가츠나베 깍두기밥 홍시 냉짬뽕 냉우동 더덕회무침바지락칼국수 오꼬노미야끼 단호박식혜 녹차아이스크림 꽃게찜감자전 아바이순대 매실주스 목살 호떡 구운김 오뜨 조개관자구이매운새우깡 간짬뽕 피카츄돈까스 닭꼬치 명량핫도그 수육 내장탕흑돼지 순댓국 해물삼합 녹차빙수 불닭볶음면 오므라이스 오징어튀김왕교자 죠리퐁 김치찜 어묵탕 고구마피자 피자빵 매운새우깡 멘보샤갈릭디핑소스 곤약 소머리국밥 전복죽 꼬치구이 기름떡볶이 누룽지탕후라이드치킨 닭꼬치 커스터드생크림빵 깻잎 해물전골 곤약마늘장아찌 김구이 양송이버섯 마끼 흰쌀밥 버섯칼국수 들깨수제비하이라이스 델리만쥬 전주비빔밥 크림레몬새우 기름장낙지볶음밥불족발 초코모찌 주먹밥 가지나물 꿀고구마 양대창 가래떡 성게알막국수 유부초밥 계란국 굴국밥 해물탕 맛밤 컵밥 야끼우동 뼈해장국소고기국밥 깡통도시락 사골우거지국 코다리냉면 갈치구이오이소박이 다슬기국 도미회 대게살 새우구이 메로구이 고기국수냉모밀 야끼소바 삼계탕 닭죽 길거리토스트 돼지주물럭 나시고랭 딤섬방어회 꿀꽈배기 계란과자 새싹비빔밥 따끈한밥에스팸한조각새우튀김 버거킹와퍼 삼각김밥 청경채 차슈 한솥도시락";

let result = foodList.split(" ");

for (let i=0; i<result.length; i++){
    document.write(result[i]);
    document.write("<br>");
}


function randomSelect() {
    document.querySelector('#randomValue').innerHTML = result[Math.floor(Math.random() * result.length)];
}



